GopalSaraf/Practicals/PSDL/include/proc/pic18f4580.inc
// Register: TXB1SIDL
#define TXB1SIDL TXB1SIDL
TXB1SIDL                                 equ 0F32h
// bitfield definitions
TXB1SIDL_EID16_POSN                      equ 0000h
TXB1SIDL_EID16_POSITION                  equ 0000h
TXB1SIDL_EID16_SIZE                      equ 0001h
TXB1SIDL_EID16_LENGTH                    equ 0001h
TXB1SIDL_EID16_MASK                      equ 0001h
TXB1SIDL_EID17_POSN                      equ 0001h
TXB1SIDL_EID17_POSITION                  equ 0001h
TXB1SIDL_EID17_SIZE                      equ 0001h
TXB1SIDL_EID17_LENGTH                    equ 0001h
TXB1SIDL_EID17_MASK                      equ 0002h
TXB1SIDL_EXIDE_POSN                      equ 0003h
TXB1SIDL_EXIDE_POSITION                  equ 0003h
TXB1SIDL_EXIDE_SIZE                      equ 0001h
TXB1SIDL_EXIDE_LENGTH                    equ 0001h
TXB1SIDL_EXIDE_MASK                      equ 0008h
TXB1SIDL_SID0_POSN                       equ 0005h
TXB1SIDL_SID0_POSITION                   equ 0005h
TXB1SIDL_SID0_SIZE                       equ 0001h
TXB1SIDL_SID0_LENGTH                     equ 0001h
TXB1SIDL_SID0_MASK                       equ 0020h
TXB1SIDL_SID1_POSN                       equ 0006h
TXB1SIDL_SID1_POSITION                   equ 0006h
TXB1SIDL_SID1_SIZE                       equ 0001h
TXB1SIDL_SID1_LENGTH                     equ 0001h
TXB1SIDL_SID1_MASK                       equ 0040h
TXB1SIDL_SID2_POSN                       equ 0007h
TXB1SIDL_SID2_POSITION                   equ 0007h
TXB1SIDL_SID2_SIZE                       equ 0001h
TXB1SIDL_SID2_LENGTH                     equ 0001h
TXB1SIDL_SID2_MASK                       equ 0080h
TXB1SIDL_TXB1EID16_POSN                  equ 0000h
TXB1SIDL_TXB1EID16_POSITION              equ 0000h
TXB1SIDL_TXB1EID16_SIZE                  equ 0001h
TXB1SIDL_TXB1EID16_LENGTH                equ 0001h
TXB1SIDL_TXB1EID16_MASK                  equ 0001h
TXB1SIDL_TXB1EID17_POSN                  equ 0001h
TXB1SIDL_TXB1EID17_POSITION              equ 0001h
TXB1SIDL_TXB1EID17_SIZE                  equ 0001h
TXB1SIDL_TXB1EID17_LENGTH                equ 0001h
TXB1SIDL_TXB1EID17_MASK                  equ 0002h
TXB1SIDL_TXB1EXIDE_POSN                  equ 0003h
TXB1SIDL_TXB1EXIDE_POSITION              equ 0003h
TXB1SIDL_TXB1EXIDE_SIZE                  equ 0001h
TXB1SIDL_TXB1EXIDE_LENGTH                equ 0001h
TXB1SIDL_TXB1EXIDE_MASK                  equ 0008h
TXB1SIDL_TXB1SID0_POSN                   equ 0005h
TXB1SIDL_TXB1SID0_POSITION               equ 0005h
TXB1SIDL_TXB1SID0_SIZE                   equ 0001h
TXB1SIDL_TXB1SID0_LENGTH                 equ 0001h
TXB1SIDL_TXB1SID0_MASK                   equ 0020h
TXB1SIDL_TXB1SID1_POSN                   equ 0006h
TXB1SIDL_TXB1SID1_POSITION               equ 0006h
TXB1SIDL_TXB1SID1_SIZE                   equ 0001h
TXB1SIDL_TXB1SID1_LENGTH                 equ 0001h
TXB1SIDL_TXB1SID1_MASK                   equ 0040h
TXB1SIDL_TXB1SID2_POSN                   equ 0007h
TXB1SIDL_TXB1SID2_POSITION               equ 0007h
TXB1SIDL_TXB1SID2_SIZE                   equ 0001h
TXB1SIDL_TXB1SID2_LENGTH                 equ 0001h
TXB1SIDL_TXB1SID2_MASK                   equ 0080h

// Register: TXB1EIDH
#define TXB1EIDH TXB1EIDH
TXB1EIDH                                 equ 0F33h
// bitfield definitions
TXB1EIDH_EID8_POSN                       equ 0000h
TXB1EIDH_EID8_POSITION                   equ 0000h
TXB1EIDH_EID8_SIZE                       equ 0001h
TXB1EIDH_EID8_LENGTH                     equ 0001h
TXB1EIDH_EID8_MASK                       equ 0001h
TXB1EIDH_EID9_POSN                       equ 0001h
TXB1EIDH_EID9_POSITION                   equ 0001h
TXB1EIDH_EID9_SIZE                       equ 0001h
TXB1EIDH_EID9_LENGTH                     equ 0001h
TXB1EIDH_EID9_MASK                       equ 0002h
TXB1EIDH_EID10_POSN                      equ 0002h
TXB1EIDH_EID10_POSITION                  equ 0002h
TXB1EIDH_EID10_SIZE                      equ 0001h
TXB1EIDH_EID10_LENGTH                    equ 0001h
TXB1EIDH_EID10_MASK                      equ 0004h
TXB1EIDH_EID11_POSN                      equ 0003h
TXB1EIDH_EID11_POSITION                  equ 0003h
TXB1EIDH_EID11_SIZE                      equ 0001h
TXB1EIDH_EID11_LENGTH                    equ 0001h
TXB1EIDH_EID11_MASK                      equ 0008h
TXB1EIDH_EID12_POSN                      equ 0004h
TXB1EIDH_EID12_POSITION                  equ 0004h
TXB1EIDH_EID12_SIZE                      equ 0001h
TXB1EIDH_EID12_LENGTH                    equ 0001h
TXB1EIDH_EID12_MASK                      equ 0010h
TXB1EIDH_EID13_POSN                      equ 0005h
TXB1EIDH_EID13_POSITION                  equ 0005h
TXB1EIDH_EID13_SIZE                      equ 0001h
TXB1EIDH_EID13_LENGTH                    equ 0001h
TXB1EIDH_EID13_MASK                      equ 0020h
TXB1EIDH_EID14_POSN                      equ 0006h
TXB1EIDH_EID14_POSITION                  equ 0006h
TXB1EIDH_EID14_SIZE                      equ 0001h
TXB1EIDH_EID14_LENGTH                    equ 0001h
TXB1EIDH_EID14_MASK                      equ 0040h
TXB1EIDH_EID15_POSN                      equ 0007h
TXB1EIDH_EID15_POSITION                  equ 0007h
TXB1EIDH_EID15_SIZE                      equ 0001h
TXB1EIDH_EID15_LENGTH                    equ 0001h
TXB1EIDH_EID15_MASK                      equ 0080h
TXB1EIDH_TXB1EID8_POSN                   equ 0000h
TXB1EIDH_TXB1EID8_POSITION               equ 0000h
TXB1EIDH_TXB1EID8_SIZE                   equ 0001h
TXB1EIDH_TXB1EID8_LENGTH                 equ 0001h
TXB1EIDH_TXB1EID8_MASK                   equ 0001h
TXB1EIDH_TXB1EID9_POSN                   equ 0001h
TXB1EIDH_TXB1EID9_POSITION               equ 0001h
TXB1EIDH_TXB1EID9_SIZE                   equ 0001h
TXB1EIDH_TXB1EID9_LENGTH                 equ 0001h
TXB1EIDH_TXB1EID9_MASK                   equ 0002h
TXB1EIDH_TXB1EID10_POSN                  equ 0002h
TXB1EIDH_TXB1EID10_POSITION              equ 0002h
TXB1EIDH_TXB1EID10_SIZE                  equ 0001h
TXB1EIDH_TXB1EID10_LENGTH                equ 0001h
TXB1EIDH_TXB1EID10_MASK                  equ 0004h
TXB1EIDH_TXB1EID11_POSN                  equ 0003h
TXB1EIDH_TXB1EID11_POSITION              equ 0003h
TXB1EIDH_TXB1EID11_SIZE                  equ 0001h
TXB1EIDH_TXB1EID11_LENGTH                equ 0001h
TXB1EIDH_TXB1EID11_MASK                  equ 0008h
TXB1EIDH_TXB1EID12_POSN                  equ 0004h
TXB1EIDH_TXB1EID12_POSITION              equ 0004h
TXB1EIDH_TXB1EID12_SIZE                  equ 0001h
TXB1EIDH_TXB1EID12_LENGTH                equ 0001h
TXB1EIDH_TXB1EID12_MASK                  equ 0010h
TXB1EIDH_TXB1EID13_POSN                  equ 0005h
TXB1EIDH_TXB1EID13_POSITION              equ 0005h
TXB1EIDH_TXB1EID13_SIZE                  equ 0001h
TXB1EIDH_TXB1EID13_LENGTH                equ 0001h
TXB1EIDH_TXB1EID13_MASK                  equ 0020h
TXB1EIDH_TXB1EID14_POSN                  equ 0006h
TXB1EIDH_TXB1EID14_POSITION              equ 0006h
TXB1EIDH_TXB1EID14_SIZE                  equ 0001h
TXB1EIDH_TXB1EID14_LENGTH                equ 0001h
TXB1EIDH_TXB1EID14_MASK                  equ 0040h
TXB1EIDH_TXB1EID15_POSN                  equ 0007h
TXB1EIDH_TXB1EID15_POSITION              equ 0007h
TXB1EIDH_TXB1EID15_SIZE                  equ 0001h
TXB1EIDH_TXB1EID15_LENGTH                equ 0001h
TXB1EIDH_TXB1EID15_MASK                  equ 0080h

// Register: TXB1EIDL
#define TXB1EIDL TXB1EIDL
TXB1EIDL                                 equ 0F34h
// bitfield definitions
TXB1EIDL_EID0_POSN                       equ 0000h
TXB1EIDL_EID0_POSITION                   equ 0000h
TXB1EIDL_EID0_SIZE                       equ 0001h
TXB1EIDL_EID0_LENGTH                     equ 0001h
TXB1EIDL_EID0_MASK                       equ 0001h
TXB1EIDL_EID1_POSN                       equ 0001h
TXB1EIDL_EID1_POSITION                   equ 0001h
TXB1EIDL_EID1_SIZE                       equ 0001h
TXB1EIDL_EID1_LENGTH                     equ 0001h
TXB1EIDL_EID1_MASK                       equ 0002h
TXB1EIDL_EID2_POSN                       equ 0002h
TXB1EIDL_EID2_POSITION                   equ 0002h
TXB1EIDL_EID2_SIZE                       equ 0001h
TXB1EIDL_EID2_LENGTH                     equ 0001h
TXB1EIDL_EID2_MASK                       equ 0004h
TXB1EIDL_EID3_POSN                       equ 0003h
TXB1EIDL_EID3_POSITION                   equ 0003h
TXB1EIDL_EID3_SIZE                       equ 0001h
TXB1EIDL_EID3_LENGTH                     equ 0001h
TXB1EIDL_EID3_MASK                       equ 0008h
TXB1EIDL_EID4_POSN                       equ 0004h
TXB1EIDL_EID4_POSITION                   equ 0004h
TXB1EIDL_EID4_SIZE                       equ 0001h
TXB1EIDL_EID4_LENGTH                     equ 0001h
TXB1EIDL_EID4_MASK                       equ 0010h
TXB1EIDL_EID5_POSN                       equ 0005h
TXB1EIDL_EID5_POSITION                   equ 0005h
TXB1EIDL_EID5_SIZE                       equ 0001h
TXB1EIDL_EID5_LENGTH                     equ 0001h
TXB1EIDL_EID5_MASK                       equ 0020h
TXB1EIDL_EID6_POSN                       equ 0006h
TXB1EIDL_EID6_POSITION                   equ 0006h
TXB1EIDL_EID6_SIZE                       equ 0001h
TXB1EIDL_EID6_LENGTH                     equ 0001h
TXB1EIDL_EID6_MASK                       equ 0040h
TXB1EIDL_EID7_POSN                       equ 0007h
TXB1EIDL_EID7_POSITION                   equ 0007h
TXB1EIDL_EID7_SIZE                       equ 0001h
TXB1EIDL_EID7_LENGTH                     equ 0001h
TXB1EIDL_EID7_MASK                       equ 0080h
TXB1EIDL_TXB1EID0_POSN                   equ 0000h
TXB1EIDL_TXB1EID0_POSITION               equ 0000h
TXB1EIDL_TXB1EID0_SIZE                   equ 0001h
TXB1EIDL_TXB1EID0_LENGTH                 equ 0001h
TXB1EIDL_TXB1EID0_MASK                   equ 0001h
TXB1EIDL_TXB1EID1_POSN                   equ 0001h
TXB1EIDL_TXB1EID1_POSITION               equ 0001h
TXB1EIDL_TXB1EID1_SIZE                   equ 0001h
TXB1EIDL_TXB1EID1_LENGTH                 equ 0001h
TXB1EIDL_TXB1EID1_MASK                   equ 0002h
TXB1EIDL_TXB1EID2_POSN                   equ 0002h
TXB1EIDL_TXB1EID2_POSITION               equ 0002h
TXB1EIDL_TXB1EID2_SIZE                   equ 0001h
TXB1EIDL_TXB1EID2_LENGTH                 equ 0001h
TXB1EIDL_TXB1EID2_MASK                   equ 0004h
TXB1EIDL_TXB1EID3_POSN                   equ 0003h
TXB1EIDL_TXB1EID3_POSITION               equ 0003h
TXB1EIDL_TXB1EID3_SIZE                   equ 0001h
TXB1EIDL_TXB1EID3_LENGTH                 equ 0001h
TXB1EIDL_TXB1EID3_MASK                   equ 0008h
TXB1EIDL_TXB1EID4_POSN                   equ 0004h
TXB1EIDL_TXB1EID4_POSITION               equ 0004h
TXB1EIDL_TXB1EID4_SIZE                   equ 0001h
TXB1EIDL_TXB1EID4_LENGTH                 equ 0001h
TXB1EIDL_TXB1EID4_MASK                   equ 0010h
TXB1EIDL_TXB1EID5_POSN                   equ 0005h
TXB1EIDL_TXB1EID5_POSITION               equ 0005h
TXB1EIDL_TXB1EID5_SIZE                   equ 0001h
TXB1EIDL_TXB1EID5_LENGTH                 equ 0001h
TXB1EIDL_TXB1EID5_MASK                   equ 0020h
TXB1EIDL_TXB1EID6_POSN                   equ 0006h
TXB1EIDL_TXB1EID6_POSITION               equ 0006h
TXB1EIDL_TXB1EID6_SIZE                   equ 0001h
TXB1EIDL_TXB1EID6_LENGTH                 equ 0001h
TXB1EIDL_TXB1EID6_MASK                   equ 0040h
TXB1EIDL_TXB1EID7_POSN                   equ 0007h
TXB1EIDL_TXB1EID7_POSITION               equ 0007h
TXB1EIDL_TXB1EID7_SIZE                   equ 0001h
TXB1EIDL_TXB1EID7_LENGTH                 equ 0001h
TXB1EIDL_TXB1EID7_MASK                   equ 0080h

// Register: TXB1DLC
#define TXB1DLC TXB1DLC
TXB1DLC                                  equ 0F35h
// bitfield definitions
TXB1DLC_DLC0_POSN                        equ 0000h
TXB1DLC_DLC0_POSITION                    equ 0000h
TXB1DLC_DLC0_SIZE                        equ 0001h
TXB1DLC_DLC0_LENGTH                      equ 0001h
TXB1DLC_DLC0_MASK                        equ 0001h
TXB1DLC_DLC1_POSN                        equ 0001h
TXB1DLC_DLC1_POSITION                    equ 0001h
TXB1DLC_DLC1_SIZE                        equ 0001h
TXB1DLC_DLC1_LENGTH                      equ 0001h
TXB1DLC_DLC1_MASK                        equ 0002h
TXB1DLC_DLC2_POSN                        equ 0002h
TXB1DLC_DLC2_POSITION                    equ 0002h
TXB1DLC_DLC2_SIZE                        equ 0001h
TXB1DLC_DLC2_LENGTH                      equ 0001h
TXB1DLC_DLC2_MASK                        equ 0004h
TXB1DLC_DLC3_POSN                        equ 0003h
TXB1DLC_DLC3_POSITION                    equ 0003h
TXB1DLC_DLC3_SIZE                        equ 0001h
TXB1DLC_DLC3_LENGTH                      equ 0001h
TXB1DLC_DLC3_MASK                        equ 0008h
TXB1DLC_TXRTR_POSN                       equ 0006h
TXB1DLC_TXRTR_POSITION                   equ 0006h
TXB1DLC_TXRTR_SIZE                       equ 0001h
TXB1DLC_TXRTR_LENGTH                     equ 0001h
TXB1DLC_TXRTR_MASK                       equ 0040h
TXB1DLC_TXB1DLC0_POSN                    equ 0000h
TXB1DLC_TXB1DLC0_POSITION                equ 0000h
TXB1DLC_TXB1DLC0_SIZE                    equ 0001h
TXB1DLC_TXB1DLC0_LENGTH                  equ 0001h
TXB1DLC_TXB1DLC0_MASK                    equ 0001h
TXB1DLC_TXB1DLC1_POSN                    equ 0001h
TXB1DLC_TXB1DLC1_POSITION                equ 0001h
TXB1DLC_TXB1DLC1_SIZE                    equ 0001h
TXB1DLC_TXB1DLC1_LENGTH                  equ 0001h
TXB1DLC_TXB1DLC1_MASK                    equ 0002h
TXB1DLC_TXB1DLC2_POSN                    equ 0002h
TXB1DLC_TXB1DLC2_POSITION                equ 0002h
TXB1DLC_TXB1DLC2_SIZE                    equ 0001h
TXB1DLC_TXB1DLC2_LENGTH                  equ 0001h
TXB1DLC_TXB1DLC2_MASK                    equ 0004h
TXB1DLC_TXB1DLC3_POSN                    equ 0003h
TXB1DLC_TXB1DLC3_POSITION                equ 0003h
TXB1DLC_TXB1DLC3_SIZE                    equ 0001h
TXB1DLC_TXB1DLC3_LENGTH                  equ 0001h
TXB1DLC_TXB1DLC3_MASK                    equ 0008h
TXB1DLC_TXB1RTR_POSN                     equ 0006h
TXB1DLC_TXB1RTR_POSITION                 equ 0006h
TXB1DLC_TXB1RTR_SIZE                     equ 0001h
TXB1DLC_TXB1RTR_LENGTH                   equ 0001h
TXB1DLC_TXB1RTR_MASK                     equ 0040h

// Register: TXB1D0
#define TXB1D0 TXB1D0
TXB1D0                                   equ 0F36h
// bitfield definitions
TXB1D0_TXB1D00_POSN                      equ 0000h
TXB1D0_TXB1D00_POSITION                  equ 0000h
TXB1D0_TXB1D00_SIZE                      equ 0001h
TXB1D0_TXB1D00_LENGTH                    equ 0001h
TXB1D0_TXB1D00_MASK                      equ 0001h
TXB1D0_TXB1D01_POSN                      equ 0001h
TXB1D0_TXB1D01_POSITION                  equ 0001h
TXB1D0_TXB1D01_SIZE                      equ 0001h
TXB1D0_TXB1D01_LENGTH                    equ 0001h
TXB1D0_TXB1D01_MASK                      equ 0002h
TXB1D0_TXB1D02_POSN                      equ 0002h
TXB1D0_TXB1D02_POSITION                  equ 0002h
TXB1D0_TXB1D02_SIZE                      equ 0001h
TXB1D0_TXB1D02_LENGTH                    equ 0001h
TXB1D0_TXB1D02_MASK                      equ 0004h
TXB1D0_TXB1D03_POSN                      equ 0003h
TXB1D0_TXB1D03_POSITION                  equ 0003h
TXB1D0_TXB1D03_SIZE                      equ 0001h
TXB1D0_TXB1D03_LENGTH                    equ 0001h
TXB1D0_TXB1D03_MASK                      equ 0008h
TXB1D0_TXB1D04_POSN                      equ 0004h
TXB1D0_TXB1D04_POSITION                  equ 0004h
TXB1D0_TXB1D04_SIZE                      equ 0001h
TXB1D0_TXB1D04_LENGTH                    equ 0001h
TXB1D0_TXB1D04_MASK                      equ 0010h
TXB1D0_TXB1D05_POSN                      equ 0005h
TXB1D0_TXB1D05_POSITION                  equ 0005h
TXB1D0_TXB1D05_SIZE                      equ 0001h
TXB1D0_TXB1D05_LENGTH                    equ 0001h
TXB1D0_TXB1D05_MASK                      equ 0020h
TXB1D0_TXB1D06_POSN                      equ 0006h
TXB1D0_TXB1D06_POSITION                  equ 0006h
TXB1D0_TXB1D06_SIZE                      equ 0001h
TXB1D0_TXB1D06_LENGTH                    equ 0001h
TXB1D0_TXB1D06_MASK                      equ 0040h
TXB1D0_TXB1D07_POSN                      equ 0007h
TXB1D0_TXB1D07_POSITION                  equ 0007h
TXB1D0_TXB1D07_SIZE                      equ 0001h
TXB1D0_TXB1D07_LENGTH                    equ 0001h
TXB1D0_TXB1D07_MASK                      equ 0080h

// Register: TXB1D1
#define TXB1D1 TXB1D1
TXB1D1                                   equ 0F37h
// bitfield definitions
TXB1D1_TXB1D10_POSN                      equ 0000h
TXB1D1_TXB1D10_POSITION                  equ 0000h
TXB1D1_TXB1D10_SIZE                      equ 0001h
TXB1D1_TXB1D10_LENGTH                    equ 0001h
TXB1D1_TXB1D10_MASK                      equ 0001h
TXB1D1_TXB1D11_POSN                      equ 0001h
TXB1D1_TXB1D11_POSITION                  equ 0001h
TXB1D1_TXB1D11_SIZE                      equ 0001h
TXB1D1_TXB1D11_LENGTH                    equ 0001h
TXB1D1_TXB1D11_MASK                      equ 0002h
TXB1D1_TXB1D12_POSN                      equ 0002h
TXB1D1_TXB1D12_POSITION                  equ 0002h
TXB1D1_TXB1D12_SIZE                      equ 0001h
TXB1D1_TXB1D12_LENGTH                    equ 0001h
TXB1D1_TXB1D12_MASK                      equ 0004h
TXB1D1_TXB1D13_POSN                      equ 0003h
TXB1D1_TXB1D13_POSITION                  equ 0003h
TXB1D1_TXB1D13_SIZE                      equ 0001h
TXB1D1_TXB1D13_LENGTH                    equ 0001h
TXB1D1_TXB1D13_MASK                      equ 0008h
TXB1D1_TXB1D14_POSN                      equ 0004h
TXB1D1_TXB1D14_POSITION                  equ 0004h
TXB1D1_TXB1D14_SIZE                      equ 0001h
TXB1D1_TXB1D14_LENGTH                    equ 0001h
TXB1D1_TXB1D14_MASK                      equ 0010h
TXB1D1_TXB1D15_POSN                      equ 0005h
TXB1D1_TXB1D15_POSITION                  equ 0005h
TXB1D1_TXB1D15_SIZE                      equ 0001h
TXB1D1_TXB1D15_LENGTH                    equ 0001h
TXB1D1_TXB1D15_MASK                      equ 0020h
TXB1D1_TXB1D16_POSN                      equ 0006h
TXB1D1_TXB1D16_POSITION                  equ 0006h
TXB1D1_TXB1D16_SIZE                      equ 0001h
TXB1D1_TXB1D16_LENGTH                    equ 0001h
TXB1D1_TXB1D16_MASK                      equ 0040h
TXB1D1_TXB1D17_POSN                      equ 0007h
TXB1D1_TXB1D17_POSITION                  equ 0007h
TXB1D1_TXB1D17_SIZE                      equ 0001h
TXB1D1_TXB1D17_LENGTH                    equ 0001h
TXB1D1_TXB1D17_MASK                      equ 0080h

// Register: TXB1D2
#define TXB1D2 TXB1D2
TXB1D2                                   equ 0F38h
// bitfield definitions
TXB1D2_TXB1D20_POSN                      equ 0000h
TXB1D2_TXB1D20_POSITION                  equ 0000h
TXB1D2_TXB1D20_SIZE                      equ 0001h
TXB1D2_TXB1D20_LENGTH                    equ 0001h
TXB1D2_TXB1D20_MASK                      equ 0001h
TXB1D2_TXB1D21_POSN                      equ 0001h
TXB1D2_TXB1D21_POSITION                  equ 0001h
TXB1D2_TXB1D21_SIZE                      equ 0001h
TXB1D2_TXB1D21_LENGTH                    equ 0001h
TXB1D2_TXB1D21_MASK                      equ 0002h
TXB1D2_TXB1D22_POSN                      equ 0002h
TXB1D2_TXB1D22_POSITION                  equ 0002h
TXB1D2_TXB1D22_SIZE                      equ 0001h
TXB1D2_TXB1D22_LENGTH                    equ 0001h
TXB1D2_TXB1D22_MASK                      equ 0004h
TXB1D2_TXB1D23_POSN                      equ 0003h
TXB1D2_TXB1D23_POSITION                  equ 0003h
TXB1D2_TXB1D23_SIZE                      equ 0001h
TXB1D2_TXB1D23_LENGTH                    equ 0001h
TXB1D2_TXB1D23_MASK                      equ 0008h
TXB1D2_TXB1D24_POSN                      equ 0004h
TXB1D2_TXB1D24_POSITION                  equ 0004h
TXB1D2_TXB1D24_SIZE                      equ 0001h
TXB1D2_TXB1D24_LENGTH                    equ 0001h
TXB1D2_TXB1D24_MASK                      equ 0010h
TXB1D2_TXB1D25_POSN                      equ 0005h
TXB1D2_TXB1D25_POSITION                  equ 0005h
TXB1D2_TXB1D25_SIZE                      equ 0001h
TXB1D2_TXB1D25_LENGTH                    equ 0001h
TXB1D2_TXB1D25_MASK                      equ 0020h
TXB1D2_TXB1D26_POSN                      equ 0006h
TXB1D2_TXB1D26_POSITION                  equ 0006h
TXB1D2_TXB1D26_SIZE                      equ 0001h
TXB1D2_TXB1D26_LENGTH                    equ 0001h
TXB1D2_TXB1D26_MASK                      equ 0040h
TXB1D2_TXB1D27_POSN                      equ 0007h
TXB1D2_TXB1D27_POSITION                  equ 0007h
TXB1D2_TXB1D27_SIZE                      equ 0001h
TXB1D2_TXB1D27_LENGTH                    equ 0001h
TXB1D2_TXB1D27_MASK                      equ 0080h

// Register: TXB1D3
#define TXB1D3 TXB1D3
TXB1D3                                   equ 0F39h
// bitfield definitions
TXB1D3_TXB1D30_POSN                      equ 0000h
TXB1D3_TXB1D30_POSITION                  equ 0000h
TXB1D3_TXB1D30_SIZE                      equ 0001h
TXB1D3_TXB1D30_LENGTH                    equ 0001h
TXB1D3_TXB1D30_MASK                      equ 0001h
TXB1D3_TXB1D31_POSN                      equ 0001h
TXB1D3_TXB1D31_POSITION                  equ 0001h
TXB1D3_TXB1D31_SIZE                      equ 0001h
TXB1D3_TXB1D31_LENGTH                    equ 0001h
TXB1D3_TXB1D31_MASK                      equ 0002h
TXB1D3_TXB1D32_POSN                      equ 0002h
TXB1D3_TXB1D32_POSITION                  equ 0002h
TXB1D3_TXB1D32_SIZE                      equ 0001h
TXB1D3_TXB1D32_LENGTH                    equ 0001h
TXB1D3_TXB1D32_MASK                      equ 0004h
TXB1D3_TXB1D33_POSN                      equ 0003h
TXB1D3_TXB1D33_POSITION                  equ 0003h
TXB1D3_TXB1D33_SIZE                      equ 0001h
TXB1D3_TXB1D33_LENGTH                    equ 0001h
TXB1D3_TXB1D33_MASK                      equ 0008h
TXB1D3_TXB1D34_POSN                      equ 0004h
TXB1D3_TXB1D34_POSITION                  equ 0004h
TXB1D3_TXB1D34_SIZE                      equ 0001h
TXB1D3_TXB1D34_LENGTH                    equ 0001h
TXB1D3_TXB1D34_MASK                      equ 0010h
TXB1D3_TXB1D35_POSN                      equ 0005h
TXB1D3_TXB1D35_POSITION                  equ 0005h
TXB1D3_TXB1D35_SIZE                      equ 0001h
TXB1D3_TXB1D35_LENGTH                    equ 0001h
TXB1D3_TXB1D35_MASK                      equ 0020h
TXB1D3_TXB1D36_POSN                      equ 0006h
TXB1D3_TXB1D36_POSITION                  equ 0006h
TXB1D3_TXB1D36_SIZE                      equ 0001h
TXB1D3_TXB1D36_LENGTH                    equ 0001h
TXB1D3_TXB1D36_MASK                      equ 0040h
TXB1D3_TXB1D37_POSN                      equ 0007h
TXB1D3_TXB1D37_POSITION                  equ 0007h
TXB1D3_TXB1D37_SIZE                      equ 0001h
TXB1D3_TXB1D37_LENGTH                    equ 0001h
TXB1D3_TXB1D37_MASK                      equ 0080h

