GopalSaraf/Practicals/PSDL/include/proc/pic18f4580.inc
// Register: TRISD
#define TRISD TRISD
TRISD                                    equ 0F95h
// bitfield definitions
TRISD_TRISD0_POSN                        equ 0000h
TRISD_TRISD0_POSITION                    equ 0000h
TRISD_TRISD0_SIZE                        equ 0001h
TRISD_TRISD0_LENGTH                      equ 0001h
TRISD_TRISD0_MASK                        equ 0001h
TRISD_TRISD1_POSN                        equ 0001h
TRISD_TRISD1_POSITION                    equ 0001h
TRISD_TRISD1_SIZE                        equ 0001h
TRISD_TRISD1_LENGTH                      equ 0001h
TRISD_TRISD1_MASK                        equ 0002h
TRISD_TRISD2_POSN                        equ 0002h
TRISD_TRISD2_POSITION                    equ 0002h
TRISD_TRISD2_SIZE                        equ 0001h
TRISD_TRISD2_LENGTH                      equ 0001h
TRISD_TRISD2_MASK                        equ 0004h
TRISD_TRISD3_POSN                        equ 0003h
TRISD_TRISD3_POSITION                    equ 0003h
TRISD_TRISD3_SIZE                        equ 0001h
TRISD_TRISD3_LENGTH                      equ 0001h
TRISD_TRISD3_MASK                        equ 0008h
TRISD_TRISD4_POSN                        equ 0004h
TRISD_TRISD4_POSITION                    equ 0004h
TRISD_TRISD4_SIZE                        equ 0001h
TRISD_TRISD4_LENGTH                      equ 0001h
TRISD_TRISD4_MASK                        equ 0010h
TRISD_TRISD5_POSN                        equ 0005h
TRISD_TRISD5_POSITION                    equ 0005h
TRISD_TRISD5_SIZE                        equ 0001h
TRISD_TRISD5_LENGTH                      equ 0001h
TRISD_TRISD5_MASK                        equ 0020h
TRISD_TRISD6_POSN                        equ 0006h
TRISD_TRISD6_POSITION                    equ 0006h
TRISD_TRISD6_SIZE                        equ 0001h
TRISD_TRISD6_LENGTH                      equ 0001h
TRISD_TRISD6_MASK                        equ 0040h
TRISD_TRISD7_POSN                        equ 0007h
TRISD_TRISD7_POSITION                    equ 0007h
TRISD_TRISD7_SIZE                        equ 0001h
TRISD_TRISD7_LENGTH                      equ 0001h
TRISD_TRISD7_MASK                        equ 0080h
TRISD_RD0_POSN                           equ 0000h
TRISD_RD0_POSITION                       equ 0000h
TRISD_RD0_SIZE                           equ 0001h
TRISD_RD0_LENGTH                         equ 0001h
TRISD_RD0_MASK                           equ 0001h
TRISD_RD1_POSN                           equ 0001h
TRISD_RD1_POSITION                       equ 0001h
TRISD_RD1_SIZE                           equ 0001h
TRISD_RD1_LENGTH                         equ 0001h
TRISD_RD1_MASK                           equ 0002h
TRISD_RD2_POSN                           equ 0002h
TRISD_RD2_POSITION                       equ 0002h
TRISD_RD2_SIZE                           equ 0001h
TRISD_RD2_LENGTH                         equ 0001h
TRISD_RD2_MASK                           equ 0004h
TRISD_RD3_POSN                           equ 0003h
TRISD_RD3_POSITION                       equ 0003h
TRISD_RD3_SIZE                           equ 0001h
TRISD_RD3_LENGTH                         equ 0001h
TRISD_RD3_MASK                           equ 0008h
TRISD_RD4_POSN                           equ 0004h
TRISD_RD4_POSITION                       equ 0004h
TRISD_RD4_SIZE                           equ 0001h
TRISD_RD4_LENGTH                         equ 0001h
TRISD_RD4_MASK                           equ 0010h
TRISD_RD5_POSN                           equ 0005h
TRISD_RD5_POSITION                       equ 0005h
TRISD_RD5_SIZE                           equ 0001h
TRISD_RD5_LENGTH                         equ 0001h
TRISD_RD5_MASK                           equ 0020h
TRISD_RD6_POSN                           equ 0006h
TRISD_RD6_POSITION                       equ 0006h
TRISD_RD6_SIZE                           equ 0001h
TRISD_RD6_LENGTH                         equ 0001h
TRISD_RD6_MASK                           equ 0040h
TRISD_RD7_POSN                           equ 0007h
TRISD_RD7_POSITION                       equ 0007h
TRISD_RD7_SIZE                           equ 0001h
TRISD_RD7_LENGTH                         equ 0001h
TRISD_RD7_MASK                           equ 0080h

// Register: TRISE
#define TRISE TRISE
TRISE                                    equ 0F96h
// bitfield definitions
TRISE_TRISE0_POSN                        equ 0000h
TRISE_TRISE0_POSITION                    equ 0000h
TRISE_TRISE0_SIZE                        equ 0001h
TRISE_TRISE0_LENGTH                      equ 0001h
TRISE_TRISE0_MASK                        equ 0001h
TRISE_TRISE1_POSN                        equ 0001h
TRISE_TRISE1_POSITION                    equ 0001h
TRISE_TRISE1_SIZE                        equ 0001h
TRISE_TRISE1_LENGTH                      equ 0001h
TRISE_TRISE1_MASK                        equ 0002h
TRISE_TRISE2_POSN                        equ 0002h
TRISE_TRISE2_POSITION                    equ 0002h
TRISE_TRISE2_SIZE                        equ 0001h
TRISE_TRISE2_LENGTH                      equ 0001h
TRISE_TRISE2_MASK                        equ 0004h
TRISE_PSPMODE_POSN                       equ 0004h
TRISE_PSPMODE_POSITION                   equ 0004h
TRISE_PSPMODE_SIZE                       equ 0001h
TRISE_PSPMODE_LENGTH                     equ 0001h
TRISE_PSPMODE_MASK                       equ 0010h
TRISE_IBOV_POSN                          equ 0005h
TRISE_IBOV_POSITION                      equ 0005h
TRISE_IBOV_SIZE                          equ 0001h
TRISE_IBOV_LENGTH                        equ 0001h
TRISE_IBOV_MASK                          equ 0020h
TRISE_OBF_POSN                           equ 0006h
TRISE_OBF_POSITION                       equ 0006h
TRISE_OBF_SIZE                           equ 0001h
TRISE_OBF_LENGTH                         equ 0001h
TRISE_OBF_MASK                           equ 0040h
TRISE_IBF_POSN                           equ 0007h
TRISE_IBF_POSITION                       equ 0007h
TRISE_IBF_SIZE                           equ 0001h
TRISE_IBF_LENGTH                         equ 0001h
TRISE_IBF_MASK                           equ 0080h
TRISE_RE0_POSN                           equ 0000h
TRISE_RE0_POSITION                       equ 0000h
TRISE_RE0_SIZE                           equ 0001h
TRISE_RE0_LENGTH                         equ 0001h
TRISE_RE0_MASK                           equ 0001h
TRISE_RE1_POSN                           equ 0001h
TRISE_RE1_POSITION                       equ 0001h
TRISE_RE1_SIZE                           equ 0001h
TRISE_RE1_LENGTH                         equ 0001h
TRISE_RE1_MASK                           equ 0002h
TRISE_RE2_POSN                           equ 0002h
TRISE_RE2_POSITION                       equ 0002h
TRISE_RE2_SIZE                           equ 0001h
TRISE_RE2_LENGTH                         equ 0001h
TRISE_RE2_MASK                           equ 0004h

